{
    "invoice": "The desired JSON format for representing the extracted data from the invoice should follow the structure outlined below: \n\n```json \n{\n  \"Invoice\": {\n    \"Type\": \"String\",\n    \"InvoiceNumber\": \"Number\",\n    \"Date\": \"String (in the following format: MM-DD-YYYY)\",\n    \"Seller\": {\n      \"Name\": \"String\",\n      \"Address\": \"String\",\n      \"ContactDetails\": {\n        \"Email\": \"String\",\n        \"PhoneNumber\": \"String\"\n      }\n    },\n    \"Buyer\": {\n      \"Name\": \"String\",\n      \"Address\": \"String\",\n      \"ContactDetails\": {\n        \"Email\": \"String\",\n        \"PhoneNumber\": \"String\"\n      }\n    },\n    \"InvoiceDetails\": {\n        \"ProductDetails\": {\n            \"ProductName\": \"String\",\n            \"Quantity\": \"Number\",\n            \"Price\": \"Number\"\n        },\n        \"Subtotal\": \"Number\",\n        \"Tax\": \"Number\",\n        \"Total\": \"Number\"\n    },\n    \"PaymentDetails\": {\n      \"DueDate\": \"String (in the following format: MM-DD-YYYY)\",\n      \"PaymentInfo\": \"String\",\n      \"PaymentStatus\": \"String\"\n    }\n  }\n}\n```\nThis JSON structure captures all key information from an invoice in a clear and organized manner.",
    "securities commission form": "In order to effectively extract the necessary data from a securities commission form, the resulting data should be structured in the following JSON format:\n\n1. `SecuritiesCommissionForm`: This is the root of the JSON structure and it will be an object. This object includes all the details extracted from the securities commission form.\n\nInside `SecuritiesCommissionForm` we have the following properties:\n\n- `ID`: This will be a number. Represents the unique identifier of the securities commission form.\n\n- `SubmissionDate`: This will be a string that follows the 'YYYY-MM-DD' pattern. Indicates the date when the form was submitted to the securities commission.\n\n- `FormTitle`: This will be a string. Specifies the title of the securities commission form.\n\n- `ApplicantDetails`: This will be an object that includes information about the entity or individual submitting the form. It will have the following properties:\n    - `Name`: The name of the individual or entity. This will be a string.\n    - `Address`: The address of the individual or entity. This will be a string.\n    - `ContactNumber`: The contact number of the individual or entity. This will be a string.\n\n- `SecurityDetails`: This will be an object that contains information about the security in question. It will have the following properties:\n    - `SecurityName`: The name of the security. This will be a string.\n    - `SecurityType`: The type of the security (e.g., bond, stock, futures). This will be a string.\n    - `SecurityQuantity`: The amount of the security being offered or sold. This will be a number.\n\n- `IssuerDetails`: This will be an object that contains details about the issuer of the security. It will have the following properties:\n    - `IssuerName`: The name of the issuer. This will be a string.\n    - `IssuerAddress`: The address of the issuer. This will be a string.\n\n- `UnderwriterDetails`: This will be an object containing details about the underwriter of the securities being offered in this form. It will also include:\n    - `UnderwriterName`: The name of the underwriter. This will be a string.\n    - `UnderwriterAddress`: The address of the underwriter. This will be a string.\n\nThe outline provided above gives a comprehensive understanding of how the data extracted from a securities commission form can be represented in a well-structured JSON object.",
    "phone models comparision": "The well-structured JSON format for the extracted data from a phone model comparison document should include the following:\n\n1. \"Brand\": The brand of the phone. This should be a string. \n2. \"Model\": The model of the phone. This should be a string.\n3. \"ScreenSize\": The size of the phone's screen. This should be a number, ideally with decimal precision for fractions.\n4. \"BatteryLife\": The battery lifetime of the phone in hours. This should be a number.\n5. \"Ram\": The Random Access Memory of the phone in GB. This should be a number.\n6. \"Processor\": The processor used in the phone. This should be a string.\n7. \"CameraSpecifications\": The specifications of the phone's camera. This should be an object with properties like \"Resolution\", \"FrontCameraMP\", and \"RearCameraMP\". Please note that \"Resolution\" should be a string, whereas both \"FrontCameraMP\" and \"RearCameraMP\" should be numbers.\n8. \"Price\": The price of the phone. This should be a number and can be stored in local currency.\n9. \"Availability\": The availability of the phone. This should be a string and can contain values like \"Available\", \"Unavailable\", or \"Coming Soon\".\n\nNote: Each phone model comparison should be stored as a separate object within an array. This will allow you to maintain a catalog of phone models.\nHere is a sample JSON schema for this data:\n```\n{\n  \"PhoneComparisons\": [\n    {\n      \"Brand\": \"\",\n      \"Model\": \"\",\n      \"ScreenSize\": 0.0,\n      \"BatteryLife\": 0,\n      \"Ram\": 0,\n      \"Processor\": \"\",\n      \"CameraSpecifications\": {\n        \"Resolution\": \"\",\n        \"FrontCameraMP\": 0,\n        \"RearCameraMP\": 0\n      },\n      \"Price\": 0,\n      \"Availability\": \"\"\n    }\n  ]\n}\n``` \n\nPlease populate all the required fields as per the document specifications. Don't forget to make sure all the fields adhere to the indicated data types.",
    "transaction statement": "In order to accurately represent key extracted data from a Transaction Statement, we require a properly formatted JSON schema containing all details. The schema should be as follows:\n\nThe main JSON object should contain these properties: `accountHolderName`, `accountNumber`, and `transactions`. The data type for both `accountHolderName` and `accountNumber` should be string.\n\nThe `transactions` attribute should be an array containing multiple objects. Each transaction object within the array should have these fields: `transactionDate`, `description`, `amount`, and `balanceAfter`.\n\n`transactionDate` should be in a string format representing date (YYYY-MM-DD) or in a default JavaScript date format.\n`description` expected is a brief string description of the transaction.\n`amount` is the value of transaction and its type should be a number. It can be positive for credit transactions and negative for debits.\n`balanceAfter` is also expected to be a number and should represent the balance after the respective transaction took place.\n\nThe JSON structure should look like this: \n\n```JSON\n{\n  \"accountHolderName\": \"John Doe\",\n  \"accountNumber\": \"123456789\",\n  \"transactions\": [\n    {\"transactionDate\": \"2022-02-10\", \"description\": \"ATM Cash Withdrawal\", \"amount\": -200.00, \"balanceAfter\": 1800.00},\n    ...\n  ]\n}\n```\n\nPlease ensure that the extracted data from the Transaction Statement properly maps to this JSON structure.",
    "research paper": "The well-structured JSON format for the extracted data from a research paper should include the following fields:\n\n1. \"PaperTitle\": This field represents the title of the research paper. It should be a string data type. \n\n2. \"Authors\": This should be an array of objects, with each object representing an author. Each object within this array should have the fields as:\n    - \"Name\": A string representing the name of the author.\n    - \"Affiliation\": A string representing the institute or organization of the author. \n\n3. \"Abstract\": This field represents the abstract section of the paper, and should be a string data type. \n\n4. \"Sections\": This should be an array of objects, where each object represents a section of the paper. Each object within this array should consist of the fields as:\n    - \"SectionTitle\": A string representing the title of the section.\n    - \"SectionContent\": A string representing content of the section.\n\n5. \"Keywords\": This should be an array of strings, where each string represents a keyword for the paper.\n\n6. \"Citations\": This should be an array of strings, where each string represents a cited work.\n\n7. \"PublicationDate\": This field represents the date when the paper was published. It should be in the date-time data type format. \n\n8. \"JournalName\": This field represents the name of the journal in which the paper was published. It should be a string data type.\n\nHere is an example JSON skeleton for extracting the mentioned fields from a research paper:\n\n```json\n{\n  \"PaperTitle\": \"\",\n  \"Authors\": [\n    {\n      \"Name\": \"\",\n      \"Affiliation\": \"\"\n    }\n  ],\n  \"Abstract\": \"\",\n  \"Sections\": [\n    {\n      \"SectionTitle\": \"\",\n      \"SectionContent\": \"\"\n    }\n  ],\n  \"Keywords\": [\"\"],\n  \"Citations\": [\"\"],\n  \"PublicationDate\": \"\",\n  \"JournalName\": \"\"\n}\n```"
}